app/controllers/comments_controller.rb

  def index
    @comments = Submission.find(params[:submission_id]).comments.order(created_at: :asc)
---
SELECT "comments".* FROM "comments" WHERE "comments"."submission_id" = $1 ORDER BY "comments"."created_at" ASC  [["submission_id", 1]]

  def show
    @submission = Submission.find(params[:submission_id])
    @comment = Comment.find(params[:id])
---
SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @submission = Submission.find(params[:submission_id])
    @scomment = @submission.comments.build(comment_params)
    if @scomment.save
---
SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("submission_id", "body", "user_id", "created_at", "updated_at", "title") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["submission_id", 8], ["body", "cuerpo comentario"], ["user_id", 4], ["created_at", "2018-03-16 16:19:42.803760"], ["updated_at", "2018-03-16 16:19:42.803760"], ["title", "titulo comentario"]]

  def update
     #respond_to do |format|
       if @comment.update(comment_params)
---
UPDATE "comments" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "comments"."id" = $4  [["title", "Juan Pérezzz"], ["body", "comentarioassssx"], ["updated_at", "2018-03-30 20:40:44.345025"], ["id", 1]]

  def destroy
    if @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]