app/controllers/comments_controller.rb

  def index
    @comments = Comment.order(created_at: :desc)
---
SELECT "comments".* FROM "comments" ORDER BY "comments"."created_at" DESC