app/controllers/submissions_controller.rb

SELECT "submissions".* FROM "submissions" ORDER BY "submissions"."created_at" DESC
---
  def list
    @submissions = Submission.order(created_at: :desc)

SELECT "submissions".* FROM "submissions" ORDER BY "submissions"."created_at" DESC
---
  def index
    @submissions = Submission.order(created_at: :desc).limit(10)

INSERT INTO "submissions" ("title", "lead", "body", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "titulo"], ["lead", "bajadax"], ["body", "cuerpoz"], ["created_at", "2018-03-15 23:02:36.444062"], ["updated_at", "2018-03-15 23:02:36.444062"], ["user_id", 1]]
---
  def create
    @submission = current_user.submissions.build(submission_params)

    respond_to do |format|
      if submission_params[:title].present? && submission_params[:body].present? && submission_params[:lead].present?
        if @submission.save

UPDATE "submissions" SET "title" = $1, "lead" = $2, "updated_at" = $3 WHERE "submissions"."id" = $4  [["title", "Nuevo título de la noticia"], ["lead", nil], ["updated_at", "2018-03-30 18:01:06.801074"], ["id", 9]]
---
  def update
    respond_to do |format|
      if @submission.update(submission_params)

DELETE FROM "submissions" WHERE "submissions"."id" = $1  [["id", 1]]
---
  def destroy
    @submission.destroy

SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def upvote
    @submission = Submission.find(params[:id])

SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def set_submission
      @submission = Submission.find(params[:id])